вот тут молодой человек решил это задание https://codepen.io/RatiboR1978/pen/EbOQwv
я смотрю на него и ничего понять не могу,
1 строка  зачем ему элемент nav или событие, я даже не понимаю как это назвать

11 строка откуда у этого event столько свойств и где их посмотреть и откуда приедет,
 я ничего не вызываю

 12 строка откуда у menu эти свойства, откуда они беруться?

 19 строка опять event и новенькое свойство key


 30 строка откуда опять эти свойства у secret, что за магия там происходит,
  я не понимаю что под этими словами кроется. Я смотрел лекции и презентацию смотрел.
  Нет понимания как это все работает, а сдавать чужие работы я не хочу.
